artillery.yml
config:
  target: http://localhost:3000
  pool: 20
  processor: "./scenarioHelpers.js"
  phases:
    [
      { duration: 20, arrivalRate: 10, rampTo: 25, name: "Warm up phase" },
      {
        duration: 25,
        arrivalRate: 25,
        rampTo: 40,
        name: "Prepare for max load",
      },
      { duration: 60, arrivalRate: 40, name: "MAX LOAD" },
    ]
scenarios:
  - name: "Get reviews"
    flow:
      - loop:
          - function: "randomProductID"
          - get:
              url: "/"
          - get:
              url: "/reviews/{{ product_id }}/meta"
          - get:
              url: "/reviews/{{ product_id }}/list"
            count: 30
  - name: "Mark review as helpful"
    flow:
      - loop:
          - function: "randomReviewID"
          - put:
              url: "/reviews/helpful/{{ review_id }}"
            count: 30
  - name: "Report a review"
    flow:
      - loop:
          - function: "randomReviewID"
          - put:
              url: "/reviews/report/{{ review_id }}"
            count: 30